In [1]:
#한 데이터프레임은 야채의 가격
#또 다른 데이터프레임에는 야채의 수량
#합치기위해 merge사용, 4가지방법이있음
#1. Inner join
#2. left outer join
#3. right outer join
#4. full outer join
#Inner join은 두 데이터프레임에서 겹치는 부분만 join
#left outer join은 왼쪽 dataframe에 존재하는 것만 join
#full outer join은 양쪽 dataframe에 존재하는 것 join

In [2]:
import pandas as pd

In [3]:
price_df = pd.read_csv('Downloads/vegetable_price.csv')
quantity_df = pd.read_csv('Downloads/vegetable_quantity.csv')

In [4]:
price_df

   Product  Price
0   Potato   3000
1    Onion   1600
2  Avocado   5000
3   Garlic   1200
4   Tomato   3500
5  Lettuce   2000
6   Carrot   2500

In [5]:
quantity_df

    Product  Quantity
0    Potato        25
1     Onion        31
2   Avocado        57
3    Pepper        46
4  Broccoli        25
5  Cucumber         9

In [6]:
pd.merge(price_df, quantity_df, on='Product')
#Inner join

   Product  Price  Quantity
0   Potato   3000        25
1    Onion   1600        31
2  Avocado   5000        57

In [7]:
pd.merge(price_df, quantity_df, on='Product', how='left')

   Product  Price  Quantity
0   Potato   3000      25.0
1    Onion   1600      31.0
2  Avocado   5000      57.0
3   Garlic   1200       NaN
4   Tomato   3500       NaN
5  Lettuce   2000       NaN
6   Carrot   2500       NaN

In [8]:
pd.merge(price_df, quantity_df, on='Product', how='right')

    Product   Price  Quantity
0    Potato  3000.0        25
1     Onion  1600.0        31
2   Avocado  5000.0        57
3    Pepper     NaN        46
4  Broccoli     NaN        25
5  Cucumber     NaN         9

In [10]:
pd.merge(price_df, quantity_df, on='Product', how='outer')

    Product   Price  Quantity
0    Potato  3000.0      25.0
1     Onion  1600.0      31.0
2   Avocado  5000.0      57.0
3    Garlic  1200.0       NaN
4    Tomato  3500.0       NaN
5   Lettuce  2000.0       NaN
6    Carrot  2500.0       NaN
7    Pepper     NaN      46.0
8  Broccoli     NaN      25.0
9  Cucumber     NaN       9.0